Documents/Заявка.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Document>
		<Properties>
			<Name>Заявка</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.СвободныеМеста</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Слушатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Слушатели</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТаблицаЗаявка</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДатаНачала</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОкончания</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Курс</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Курсы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/СвободныеМеста.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<AccumulationRegister>
		<Properties>
			<Name>СвободныеМеста</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КоличествоМест</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Курс</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Курсы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Класс</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Класс</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Documents/Расписание.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Document>
		<Properties>
			<Name>Расписание</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.СвободныеМеста</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаКонца</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТаблицаРасписание</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Курс</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Курсы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Класс</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Класс</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаНачалаКурса</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОкончанияКурса</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДлительностьКурса</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Преподаватель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Преподаватели</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Нагрузка</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбъемЧасов</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ОбъемЧасов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/Заявка/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	Если ЕстьСвободныеМеста() Тогда
		Движения.СвободныеМеста.Записывать = Истина;
		Движения.СвободныеМеста.Очистить();
		Для Каждого ТекущаяСтрока Из ТаблицаЗаявка  Цикл
			Движение = Движения.СвободныеМеста.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
	        Движение.Курс = ТекущаяСтрока.Курс;
	        Движение.КоличествоМест = 1;
			Движение.Период = Дата;
			Движение.Класс = ПолучениеКлассаИзРасписания();
		КонецЦикла;	 
	Иначе
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры

Функция ЕстьСвободныеМеста()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЗаявкаТаблицаЗаявка.Ссылка КАК Заявка,
	               |	ЗаявкаТаблицаЗаявка.Курс КАК Курс,
	               |	ЕСТЬNULL(СвободныеМестаОстатки.КоличествоМестОстаток, 0) КАК КоличествоМест
	               |ИЗ
	               |	Документ.Заявка.ТаблицаЗаявка КАК ЗаявкаТаблицаЗаявка
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.СвободныеМеста.Остатки КАК СвободныеМестаОстатки
	               |		ПО ЗаявкаТаблицаЗаявка.Курс = СвободныеМестаОстатки.Курс
	               |ГДЕ
	               |	ЗаявкаТаблицаЗаявка.Ссылка = &Ссылка";

	Запрос.УстановитьПараметр("Ссылка", Ссылка);
 
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	Для каждого Строка из РезультатЗапроса Цикл 
		Если Строка.КоличествоМест <= 0 Тогда
			Сообщить("К сожалению, нет свободных мест для курса """ + Строка.Курс + """");
			Возврат Ложь;	
		КонецЕсли;
	КонецЦикла;
	
	Возврат Истина;
КонецФункции 

функция ПолучениеКлассаИзРасписания ()
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	|	РасписаниеТаблРасписание.Ссылка КАК Ссылка,
	|	ЗаявкаТаблЗаявка.Курс КАК Курс,
	|	РасписаниеТаблРасписание.Класс КАК Класс
	|ИЗ
	|	Документ.Заявка.ТаблицаЗаявка КАК ЗаявкаТаблЗаявка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Расписание.ТаблицаРасписание КАК РасписаниеТаблРасписание
	|		ПО ЗаявкаТаблЗаявка.Курс = РасписаниеТаблРасписание.Курс
	|ГДЕ
	|	ЗаявкаТаблЗаявка.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	Результат = РезультатЗапроса.Выгрузить();
	Возврат Результат[0].Класс;
КонецФункции
